tests/0_54_445_6/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       11863;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       11873;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          423;
        startFace       11883;
    }
    baffle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          47;
        startFace       12306;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12108;
        startFace       12353;
    }
)

// ************************************************************************* //
